In [19]:
import pandas as pd
df=pd.read_csv("c.csv")
print(df)

  Name  Class Roll.no
0    A      1      19
1    B      2     NAN
2    C      3     NAN
3    D      4      90

In [20]:
df.isnull()

    Name  Class  Roll.no
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False

In [21]:
df.dropna()

  Name  Class Roll.no
0    A      1      19
1    B      2     NAN
2    C      3     NAN
3    D      4      90

In [22]:
df.astype

<bound method NDFrame.astype of   Name  Class Roll.no
0    A      1      19
1    B      2     NAN
2    C      3     NAN
3    D      4      90>

In [23]:
d.dropna(how="all")

  Name  Class Roll.no
0    A      1      19
1    B      2     NAN
2    C      3     NAN
3    D      4      90

In [24]:
d.dropna(how="any")

  Name  Class Roll.no
0    A      1      19
1    B      2     NAN
2    C      3     NAN
3    D      4      90